XmlTemplates/Ws-info-soap.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
  <soap:Header>
    <wsa:Action wsu:Id="Id-15cf6bfe-b210-4a81-809d-319f34cb0bd0">http://www.gordic.cz/ws/xrg-ssl/v_1.0.0.0/Ws-info</wsa:Action>
    <wsa:MessageID wsu:Id="Id-b65bf57b-fd41-445d-8cd7-8ae258e791f1">uuid:64133971-9905-4aac-adb8-42c138a639b9</wsa:MessageID>
    <wsa:ReplyTo wsu:Id="Id-1a32d2ef-88c6-4863-81de-6affe37a4efd">
      <wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address>
    </wsa:ReplyTo>
    <wsa:To wsu:Id="Id-0053c4d0-763c-41c7-9561-d02961c4e6bb">http://ws.gordic.cz/354/Ssl2/Ssl.asmx</wsa:To>
    <wsse:Security soap:mustUnderstand="1">
      <wsu:Timestamp wsu:Id="Timestamp-f718f7bb-7a0c-4953-8fa5-c453fa3c3e8b">
        <wsu:Created>2006-07-26T15:03:41Z</wsu:Created>
      </wsu:Timestamp>
      <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="SecurityToken-6a0e2e56-c0ea-4645-9be3-84a942a7e7b7">
        <wsse:Username>DEMOAIE0A0UN\etnetera</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">Hw1jCcpmlrFCnzU51iv9Sa87QpA=</wsse:Password>
        <wsse:Nonce>HWhOl36kze1ucU2DEl/cyA==</wsse:Nonce>
        <wsu:Created>2006-07-26T15:03:41Z</wsu:Created>
      </wsse:UsernameToken>
      <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
        <SignedInfo>
          <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
          <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1" />
          <Reference URI="#Id-15cf6bfe-b210-4a81-809d-319f34cb0bd0">
            <Transforms>
              <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
            </Transforms>
            <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
            <DigestValue>TDCKgSVa/4Wc+74FwFyDBB1csdc=</DigestValue>
          </Reference>
          <Reference URI="#Id-b65bf57b-fd41-445d-8cd7-8ae258e791f1">
            <Transforms>
              <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
            </Transforms>
            <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
            <DigestValue>n3nXidlMEqRw/n9guv35RW0ppwI=</DigestValue>
          </Reference>
          <Reference URI="#Id-1a32d2ef-88c6-4863-81de-6affe37a4efd">
            <Transforms>
              <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
            </Transforms>
            <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
            <DigestValue>5h78YdUELqB4GVAk6571074EbrY=</DigestValue>
          </Reference>
          <Reference URI="#Id-0053c4d0-763c-41c7-9561-d02961c4e6bb">
            <Transforms>
              <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
            </Transforms>
            <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
            <DigestValue>HF0mxRfiOWWTvfllQsXTv9VW/0E=</DigestValue>
          </Reference>
          <Reference URI="#Timestamp-f718f7bb-7a0c-4953-8fa5-c453fa3c3e8b">
            <Transforms>
              <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
            </Transforms>
            <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
            <DigestValue>WBY4Hk5Nsa50kIGyyBwIp8L6T/4=</DigestValue>
          </Reference>
          <Reference URI="#Id-0f09e43e-edae-4a34-bc2e-84d87192fde7">
            <Transforms>
              <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
            </Transforms>
            <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
            <DigestValue>xmiC7FczDPs297ObR9dvhUfPZT4=</DigestValue>
          </Reference>
        </SignedInfo>
        <SignatureValue>M6XzYvSTsGRh9mk9gCK/nBTSJVA=</SignatureValue>
        <KeyInfo>
          <wsse:SecurityTokenReference>
            <wsse:Reference URI="#SecurityToken-6a0e2e56-c0ea-4645-9be3-84a942a7e7b7" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#UsernameToken" />
          </wsse:SecurityTokenReference>
        </KeyInfo>
      </Signature>
    </wsse:Security>
  </soap:Header>
  <soap:Body wsu:Id="Id-0f09e43e-edae-4a34-bc2e-84d87192fde7">
    <Ws-info xmlns="http://www.gordic.cz/ws/xrg-ssl/v_1.0.0.0">
      <requestXml>
        <Xrg xmlns="http://www.gordic.cz/xrg/ws-info/request/v_1.0.0.0">
          <Ws-info>
            <Typ-pozadavku>kompletni</Typ-pozadavku>
          </Ws-info>
        </Xrg>
      </requestXml>
    </Ws-info>
  </soap:Body>
</soap:Envelope>